'''Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
Класс-исключение должен контролировать типы данных элементов списка.
Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу
скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список выводится на экран.
Подсказка: для данного задания примем, что пользователь может вводить только числа и строки. При вводе пользователем
очередного элемента необходимо реализовать проверку типа элемента и вносить его в список, только если введено число.
Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
При этом работа скрипта не должна завершаться.'''

class OwnError:

    def __init__(self, *args):
        self.my_list = []

    def my_input(self):
        while True:
            try:
                res = int(input('Введите число: '))
                self.my_list.append(res)
                print(f'Список чисел : {self.my_list} \n ')
            except:
                print('Недопустимое значение')
                res_1 = input('Введите число: ')
                print(try_except.my_input())
                if not res_1.isdigit():
                    return 'Конец'

try_except = OwnError(1)
print(try_except.my_input())
